let spisok = [
    {
        "id": "01-01",
        "name": "Новый год",
        "description": "Главный зимний праздник."
    },
    {
        "id": "01-02",
        "name": "День мягких подушек",
        "description": "Время для отдыха после праздничной ночи."
    },
    {
        "id": "01-03",
        "name": "День рождения соломинки для коктейлей",
        "description": "Запатентована в 1888 году."
    },
    {
        "id": "01-04",
        "name": "День азбуки Брайля",
        "description": "В честь создателя шрифта для незрячих."
    },
    {
        "id": "01-05",
        "name": "Международный день бойскаутов",
        "description": "Праздник молодежного движения."
    },
    {
        "id": "01-06",
        "name": "Рождественский сочельник",
        "description": "Вечер накануне Рождества."
    },
    {
        "id": "01-07",
        "name": "Рождество Христово",
        "description": "Один из главных христианских праздников."
    },
    {
        "id": "01-08",
        "name": "День детского кино",
        "description": "Учрежден в Москве в 1898 году."
    },
    {
        "id": "01-09",
        "name": "Международный день хореографа",
        "description": "Праздник мастеров танца."
    },
    {
        "id": "01-10",
        "name": "День своеобразных людей",
        "description": "Праздник индивидуальности."
    },
    {
        "id": "01-11",
        "name": "День «спасибо»",
        "description": "Самый вежливый день в году."
    },
    {
        "id": "01-12",
        "name": "День работника прокуратуры РФ",
        "description": "Профессиональный праздник."
    },
    {
        "id": "01-13",
        "name": "День российской печати",
        "description": "В этот день вышла первая газета «Ведомости»."
    },
    {
        "id": "01-14",
        "name": "Старый Новый год",
        "description": "Традиция отмечать праздник по старому стилю."
    },
    {
        "id": "01-15",
        "name": "День зимующих птиц",
        "description": "Время наполнить кормушки."
    },
    {
        "id": "01-16",
        "name": "Всемирный день The Beatles",
        "description": "В честь легендарной «ливерпульской четверки»."
    },
    {
        "id": "01-17",
        "name": "День детских изобретений",
        "description": "В честь Бенджамина Франклина."
    },
    {
        "id": "01-18",
        "name": "День Снеговика",
        "description": "Международный праздник зимнего героя."
    },
    {
        "id": "01-19",
        "name": "Крещение Господне",
        "description": "Христианский праздник с традицией купания."
    },
    {
        "id": "01-20",
        "name": "День осведомленности о пингвинах",
        "description": "Экологический праздник."
    },
    {
        "id": "01-21",
        "name": "Международный день объятий",
        "description": "Нужно обнять как можно больше людей."
    },
    {
        "id": "01-22",
        "name": "День рождения попкорна",
        "description": "Появился в США в 1893 году."
    },
    {
        "id": "01-23",
        "name": "День почерка (ручного письма)",
        "description": "Напоминание об уникальности письма от руки."
    },
    {
        "id": "01-24",
        "name": "Международный день эскимо",
        "description": "Дата получения патента на этот десерт."
    },
    {
        "id": "01-25",
        "name": "Татьянин день",
        "description": "День студенчества в России."
    },
    {
        "id": "01-26",
        "name": "Международный день таможенника",
        "description": "Профессиональный праздник."
    },
    {
        "id": "01-27",
        "name": "День снятия блокады Ленинграда",
        "description": "Важная историческая дата РФ."
    },
    {
        "id": "01-28",
        "name": "Международный день защиты персональных данных",
        "description": "О приватности в сети."
    },
    {
        "id": "01-29",
        "name": "День первооткрывателя в России",
        "description": "В честь открытия Антарктиды."
    },
    {
        "id": "01-30",
        "name": "День Мороза и Снегурочки",
        "description": "Древний славянский праздник."
    },
    {
        "id": "01-31",
        "name": "День рождения русской водки",
        "description": "День защиты диссертации Менделеева."
    },
    {
        "id": "02-01",
        "name": "Международный день десерта",
        "description": "Неофициальный, но очень вкусный праздник."
    },
    {
        "id": "02-02",
        "name": "День сурка",
        "description": "Традиция предсказания весны в США и Канаде."
    },
    {
        "id": "02-03",
        "name": "Всемирный день борьбы с ненормативной лексикой",
        "description": "День чистоты речи."
    },
    {
        "id": "02-04",
        "name": "Всемирный день борьбы против рака",
        "description": "Осведомленность о болезни."
    },
    {
        "id": "02-05",
        "name": "Всемирный день «Нутеллы»",
        "description": "Обожаемый многими праздник шоколадной пасты."
    },
    {
        "id": "02-06",
        "name": "Международный день бармена",
        "description": "Отмечается в День святого Аманда."
    },
    {
        "id": "02-07",
        "name": "День рождения огнетушителя",
        "description": "Запатентован в 1863 году."
    },
    {
        "id": "02-08",
        "name": "День российской науки",
        "description": "В честь основания Академии наук."
    },
    {
        "id": "02-09",
        "name": "Международный день стоматолога",
        "description": "Профессиональный праздник врачей."
    },
    {
        "id": "02-10",
        "name": "День памяти А.С. Пушкина",
        "description": "Годовщина гибели поэта."
    },
    {
        "id": "02-11",
        "name": "Всемирный день больного",
        "description": "День поддержки людей с недугами."
    },
    {
        "id": "02-12",
        "name": "Международный день брачных агентств",
        "description": "Праздник поиска любви."
    },
    {
        "id": "02-13",
        "name": "Всемирный день радио",
        "description": "Роль радио в современном мире."
    },
    {
        "id": "02-14",
        "name": "День святого Валентина",
        "description": "День всех влюбленных."
    },
    {
        "id": "02-15",
        "name": "День воинов-интернационалистов",
        "description": "День вывода войск из Афганистана."
    },
    {
        "id": "02-16",
        "name": "День поиска запахов",
        "description": "День внимания к ароматам вокруг."
    },
    {
        "id": "02-17",
        "name": "День спонтанного проявления доброты",
        "description": "Время делать добрые дела просто так."
    },
    {
        "id": "02-18",
        "name": "День транспортной полиции РФ",
        "description": "Профессиональный праздник."
    },
    {
        "id": "02-19",
        "name": "Всемирный день защиты морских млекопитающих",
        "description": "День китов."
    },
    {
        "id": "02-20",
        "name": "Всемирный день социальной справедливости",
        "description": "Инициатива ООН."
    },
    {
        "id": "02-21",
        "name": "Международный день родного языка",
        "description": "Сохранение языкового многообразия."
    },
    {
        "id": "02-22",
        "name": "Всемирный день размышлений",
        "description": "День скаутского движения."
    },
    {
        "id": "02-23",
        "name": "День защитника Отечества",
        "description": "Государственный праздник в РФ."
    },
    {
        "id": "02-24",
        "name": "Праздник съехавшей крыши",
        "description": "День для тех, кто любит подурачиться."
    },
    {
        "id": "02-25",
        "name": "День открытия спирта",
        "description": "Химический праздник."
    },
    {
        "id": "02-26",
        "name": "Всемирный день фисташек",
        "description": "Популярный праздник любителей орехов."
    },
    {
        "id": "02-27",
        "name": "Международный день белого медведя",
        "description": "Охрана арктических животных."
    },
    {
        "id": "02-28",
        "name": "День Арктики",
        "description": "Внимание к проблемам северного региона."
    },
    {
        "id": "02-29",
        "name": "День Касьяна",
        "description": "Считался «тяжелым» днем в народном календаре (раз в 4 года)."
    },
    {
        "id": "03-01",
        "name": "Всемирный день кошек",
        "description": "Самый пушистый праздник весны."
    },
    {
        "id": "03-02",
        "name": "Международный день спички",
        "description": "История этого простого устройства."
    },
    {
        "id": "03-03",
        "name": "Всемирный день писателя",
        "description": "Праздник мастеров слова."
    },
    {
        "id": "03-04",
        "name": "День рождения мини-юбки",
        "description": "Революция в мире моды 1960-х."
    },
    {
        "id": "03-05",
        "name": "День выключенных гаджетов",
        "description": "Повод отдохнуть от цифрового мира."
    },
    {
        "id": "03-06",
        "name": "Международный день зубного врача",
        "description": "В честь создания первой бормашины."
    },
    {
        "id": "03-07",
        "name": "День прогулки по канаве",
        "description": "День для необычных и странных приключений."
    },
    {
        "id": "03-08",
        "name": "Международный женский день",
        "description": "Праздник весны и внимания к женщинам."
    },
    {
        "id": "03-09",
        "name": "Всемирный день ди-джея",
        "description": "Благотворительная акция в пользу детей."
    },
    {
        "id": "03-10",
        "name": "День архивов в России",
        "description": "Профессиональный праздник хранителей истории."
    },
    {
        "id": "03-11",
        "name": "День сотрудников частных охранных агентств",
        "description": "Охранный бизнес в РФ."
    },
    {
        "id": "03-12",
        "name": "День работников УИС РФ",
        "description": "Профессиональный праздник Минюста."
    },
    {
        "id": "03-13",
        "name": "День тайского слона",
        "description": "Национальное животное Таиланда."
    },
    {
        "id": "03-14",
        "name": "Международный день числа «Пи»",
        "description": "Математический праздник."
    },
    {
        "id": "03-15",
        "name": "Всемирный день защиты прав потребителей",
        "description": "О правах покупателей."
    },
    {
        "id": "03-16",
        "name": "День образования подразделений ЭБиПК (ОБХСС) МВД РФ",
        "description": "Профессиональный праздник."
    },
    {
        "id": "03-17",
        "name": "День святого Патрика",
        "description": "Культурный и религиозный праздник Ирландии."
    },
    {
        "id": "03-18",
        "name": "День воссоединения Крыма с Россией",
        "description": "Государственный праздник в РФ."
    },
    {
        "id": "03-19",
        "name": "День моряка-подводника",
        "description": "Праздник ВМФ России."
    },
    {
        "id": "03-20",
        "name": "Международный день счастья",
        "description": "Праздник, инициированный ООН."
    },
    {
        "id": "03-21",
        "name": "Всемирный день поэзии",
        "description": "Популяризация чтения и стихов."
    },
    {
        "id": "03-22",
        "name": "Всемирный день водных ресурсов",
        "description": "О важности пресной воды."
    },
    {
        "id": "03-23",
        "name": "Всемирный метеорологический день",
        "description": "Праздник синоптиков."
    },
    {
        "id": "03-24",
        "name": "Всемирный день борьбы с туберкулезом",
        "description": "Охрана здоровья."
    },
    {
        "id": "03-25",
        "name": "День работника культуры РФ",
        "description": "Праздник творческих профессий."
    },
    {
        "id": "03-26",
        "name": "Фиолетовый день",
        "description": "День больных эпилепсией, осведомленность о болезни."
    },
    {
        "id": "03-27",
        "name": "Всемирный день театра",
        "description": "Главный праздник актеров и режиссеров."
    },
    {
        "id": "03-28",
        "name": "День рождения стиральной машины",
        "description": "Запатентована в 1797 году."
    },
    {
        "id": "03-29",
        "name": "День самопознания",
        "description": "Время заглянуть внутрь себя."
    },
    {
        "id": "03-30",
        "name": "День прогулки по парку",
        "description": "Напоминание о пользе свежего воздуха."
    },
    {
        "id": "03-31",
        "name": "День бэкапа",
        "description": "День резервного копирования, защита цифровых данных."
    },
    {
        "id": "04-01",
        "name": "День смеха",
        "description": "Время для шуток и розыгрышей."
    },
    {
        "id": "04-02",
        "name": "Международный день детской книги",
        "description": "В честь Г.Х. Андерсена."
    },
    {
        "id": "04-03",
        "name": "Всемирный день вечеринки",
        "description": "Идея мира через веселье."
    },
    {
        "id": "04-04",
        "name": "День святого Исидора",
        "description": "Покровителя интернета, день айтишника."
    },
    {
        "id": "04-05",
        "name": "Международный день супа",
        "description": "Популяризация здорового питания."
    },
    {
        "id": "04-06",
        "name": "Международный день спорта",
        "description": "Спорт на благо мира и развития."
    },
    {
        "id": "04-07",
        "name": "Всемирный день здоровья",
        "description": "В честь основания ВОЗ."
    },
    {
        "id": "04-08",
        "name": "Международный день цыган",
        "description": "История и культура народа."
    },
    {
        "id": "04-09",
        "name": "День бережного хранения антиквариата",
        "description": "День ценителей старины."
    },
    {
        "id": "04-10",
        "name": "День братьев и сестер",
        "description": "Укрепление семейных уз."
    },
    {
        "id": "04-11",
        "name": "Всемирный день борьбы с болезнью Паркинсона",
        "description": "Осведомленность."
    },
    {
        "id": "04-12",
        "name": "День космонавтики",
        "description": "В честь полета Юрия Гагарина."
    },
    {
        "id": "04-13",
        "name": "Всемирный день рок-н-ролла",
        "description": "В честь записи хита «Rock Around the Clock»."
    },
    {
        "id": "04-14",
        "name": "День внезапного смеха",
        "description": "Повод посмеяться без причины."
    },
    {
        "id": "04-15",
        "name": "Международный день культуры",
        "description": "В честь Пакта Рериха."
    },
    {
        "id": "04-16",
        "name": "Всемирный день голоса",
        "description": "Забота о здоровье связок."
    },
    {
        "id": "04-17",
        "name": "День ветеранов органов внутренних дел и внутренних войск РФ",
        "description": "Памятная дата."
    },
    {
        "id": "04-18",
        "name": "Международный день памятников и исторических мест",
        "description": "Охрана наследия."
    },
    {
        "id": "04-19",
        "name": "День подснежника",
        "description": "Британский праздник первых цветов."
    },
    {
        "id": "04-20",
        "name": "Национальный день донора в России",
        "description": "Посвящен сдающим кровь."
    },
    {
        "id": "04-21",
        "name": "День местного самоуправления в России",
        "description": "Профессиональный праздник."
    },
    {
        "id": "04-22",
        "name": "Международный день Матери-Земли",
        "description": "Экологические акции."
    },
    {
        "id": "04-23",
        "name": "Всемирный день книги и авторского права",
        "description": "Под эгидой ЮНЕСКО."
    },
    {
        "id": "04-24",
        "name": "Международный день солидарности молодежи",
        "description": "Объединение молодых людей."
    },
    {
        "id": "04-25",
        "name": "Всемирный день пингвинов",
        "description": "День начала миграции на север."
    },
    {
        "id": "04-26",
        "name": "Международный день интеллектуальной собственности",
        "description": "Защита идей."
    },
    {
        "id": "04-27",
        "name": "День российского парламентаризма",
        "description": "Государственный праздник."
    },
    {
        "id": "04-28",
        "name": "Всемирный день охраны труда",
        "description": "Безопасность на работе."
    },
    {
        "id": "04-29",
        "name": "Международный день танца",
        "description": "В честь Ж.-Ж. Новерра."
    },
    {
        "id": "04-30",
        "name": "День пожарной охраны России",
        "description": "Профессиональный праздник огнеборцев."
    },
    {
        "id": "05-01",
        "name": "Праздник Весны и Труда",
        "description": "День солидарности трудящихся."
    },
    {
        "id": "05-02",
        "name": "Всемирный день тунца",
        "description": "Охрана ресурсов мирового океана."
    },
    {
        "id": "05-03",
        "name": "День Солнца",
        "description": "Экологический праздник возобновляемой энергии."
    },
    {
        "id": "05-04",
        "name": "День «Звездных войн»",
        "description": "Фанатский праздник «May the 4th be with you»."
    },
    {
        "id": "05-05",
        "name": "Международный день акушерки",
        "description": "В честь тех, кто помогает жизни родиться."
    },
    {
        "id": "05-06",
        "name": "Международный день «без диет»",
        "description": "День принятия своего тела."
    },
    {
        "id": "05-07",
        "name": "День радио",
        "description": "В этот день Попов продемонстрировал первый радиоприемник."
    },
    {
        "id": "05-08",
        "name": "Всемирный день Красного Креста",
        "description": "Помощь пострадавшим во всем мире."
    },
    {
        "id": "05-09",
        "name": "День Победы",
        "description": "Главный праздник в честь победы над нацизмом."
    },
    {
        "id": "05-10",
        "name": "День «Чистого листа»",
        "description": "День для начала жизни с нуля."
    },
    {
        "id": "05-11",
        "name": "День ожидания Мэри Поппинс",
        "description": "День веры в чудеса и перемены."
    },
    {
        "id": "05-12",
        "name": "Международный день медицинской сестры",
        "description": "Профессиональный праздник."
    },
    {
        "id": "05-13",
        "name": "Всемирный день одуванчика",
        "description": "Символ расцвета весны."
    },
    {
        "id": "05-14",
        "name": "День рождения вазелина",
        "description": "Запатентован Робертом Чезбро в 1878 году."
    },
    {
        "id": "05-15",
        "name": "Международный день семьи",
        "description": "Укрепление семейных ценностей."
    },
    {
        "id": "05-16",
        "name": "Международный день света",
        "description": "Инициатива ЮНЕСКО о роли света в науке."
    },
    {
        "id": "05-17",
        "name": "Всемирный день электросвязи и информационного общества",
        "description": "Праздник цифрового мира."
    },
    {
        "id": "05-18",
        "name": "Международный день музеев",
        "description": "День бесплатных экскурсий и выставок."
    },
    {
        "id": "05-19",
        "name": "День русской печи",
        "description": "В честь символа домашнего уюта."
    },
    {
        "id": "05-20",
        "name": "Всемирный день пчел",
        "description": "О важности опылителей для планеты."
    },
    {
        "id": "05-21",
        "name": "День полярника в России",
        "description": "В честь открытия станции «Северный полюс-1»."
    },
    {
        "id": "05-22",
        "name": "Международный день биологического разнообразия",
        "description": "Охрана природы."
    },
    {
        "id": "05-23",
        "name": "Всемирный день черепахи",
        "description": "Сохранение этих древних рептилий."
    },
    {
        "id": "05-24",
        "name": "День славянской письменности и культуры",
        "description": "В честь Кирилла и Мефодия."
    },
    {
        "id": "05-25",
        "name": "День филолога",
        "description": "Праздник лингвистов и литературоведов."
    },
    {
        "id": "05-26",
        "name": "День российского предпринимательства",
        "description": "Поддержка малого и среднего бизнеса."
    },
    {
        "id": "05-27",
        "name": "Общероссийский день библиотек",
        "description": "Праздник «аптек для души»."
    },
    {
        "id": "05-28",
        "name": "День пограничника в России",
        "description": "Защита рубежей страны."
    },
    {
        "id": "05-29",
        "name": "Международный день миротворцев ООН",
        "description": "Чествование «голубых касок»."
    },
    {
        "id": "05-30",
        "name": "День окрошки",
        "description": "Самый летний суп в народном календаре."
    },
    {
        "id": "05-31",
        "name": "Всемирный день без табака",
        "description": "Глобальная акция против курения."
    },
    {
        "id": "06-01",
        "name": "Международный день защиты детей",
        "description": "Начало каникул и забота о детстве."
    },
    {
        "id": "06-02",
        "name": "День здорового питания",
        "description": "Отказ от вредной еды в России."
    },
    {
        "id": "06-03",
        "name": "Всемирный день велосипеда",
        "description": "Популяризация экологичного транспорта."
    },
    {
        "id": "06-04",
        "name": "День крапивы",
        "description": "Фестиваль народных традиций и ремесел."
    },
    {
        "id": "06-05",
        "name": "Всемирный день окружающей среды",
        "description": "Главный праздник экологов."
    },
    {
        "id": "06-06",
        "name": "Пушкинский день",
        "description": "День русского языка в день рождения поэта."
    },
    {
        "id": "06-07",
        "name": "Всемирный день безопасности пищевых продуктов",
        "description": "Здоровое питание."
    },
    {
        "id": "06-08",
        "name": "Всемирный день океанов",
        "description": "Охрана водных глубин."
    },
    {
        "id": "06-09",
        "name": "Международный день друзей",
        "description": "Лишний повод позвонить близким."
    },
    {
        "id": "06-10",
        "name": "День рождения киностудии «Союзмультфильм»",
        "description": "Основана в 1936 году."
    },
    {
        "id": "06-11",
        "name": "День неукротимой страсти",
        "description": "День сильных эмоций."
    },
    {
        "id": "06-12",
        "name": "День России",
        "description": "Главный государственный праздник страны."
    },
    {
        "id": "06-13",
        "name": "Международный день распространения информации об альбинизме",
        "description": "Осведомленность."
    },
    {
        "id": "06-14",
        "name": "Всемирный день донора крови",
        "description": "Помощь людям, нуждающимся в крови."
    },
    {
        "id": "06-15",
        "name": "Всемирный день ветра",
        "description": "Потенциал ветроэнергетики."
    },
    {
        "id": "06-16",
        "name": "День свежих овощей",
        "description": "Время переходить на летний рацион."
    },
    {
        "id": "06-17",
        "name": "Всемирный день борьбы с опустыниванием и засухой",
        "description": "Экологическая дата."
    },
    {
        "id": "06-18",
        "name": "День устойчивой гастрономии",
        "description": "Праздник местной еды."
    },
    {
        "id": "06-19",
        "name": "Всемирный день прогулки",
        "description": "Призыв замедлиться и отдохнуть."
    },
    {
        "id": "06-20",
        "name": "Всемирный день защиты слонов в зоопарках",
        "description": "Охрана животных."
    },
    {
        "id": "06-21",
        "name": "Международный день йоги",
        "description": "Гармония тела и духа в день солнцестояния."
    },
    {
        "id": "06-22",
        "name": "День памяти и скорби",
        "description": "Начало Великой Отечественной войны."
    },
    {
        "id": "06-23",
        "name": "Международный Олимпийский день",
        "description": "Зарождение современного спорта."
    },
    {
        "id": "06-24",
        "name": "День парада Победы",
        "description": "В честь первого парада в 1945 году."
    },
    {
        "id": "06-25",
        "name": "День дружбы и единения славян",
        "description": "Общность культур."
    },
    {
        "id": "06-26",
        "name": "Международный день борьбы с наркотиками",
        "description": "Здоровый образ жизни."
    },
    {
        "id": "06-27",
        "name": "День молодежи",
        "description": "Энергия и будущее страны."
    },
    {
        "id": "06-28",
        "name": "День числа Тау (τ)",
        "description": "Математический аналог дня Пи."
    },
    {
        "id": "06-29",
        "name": "День партизан и подпольщиков в России",
        "description": "Памятная дата."
    },
    {
        "id": "06-30",
        "name": "День астероида",
        "description": "В годовщину падения Тунгусского метеорита."
    },
    {
        "id": "07-01",
        "name": "День ветеранов боевых действий",
        "description": "Память о тех, кто воевал локально."
    },
    {
        "id": "07-02",
        "name": "Международный день спортивного журналиста",
        "description": "Профессиональный праздник."
    },
    {
        "id": "07-03",
        "name": "День ГИБДД в России",
        "description": "Профессиональный праздник инспекторов."
    },
    {
        "id": "07-04",
        "name": "День независимости США",
        "description": "Главный праздник Соединенных Штатов."
    },
    {
        "id": "07-05",
        "name": "День трудоголика",
        "description": "Напоминание, что работать слишком много вредно."
    },
    {
        "id": "07-06",
        "name": "Всемирный день поцелуя",
        "description": "Придумали в Великобритании, одобрила ООН."
    },
    {
        "id": "07-07",
        "name": "День Ивана Купала",
        "description": "Древний славянский праздник воды и огня."
    },
    {
        "id": "07-08",
        "name": "День семьи, любви и верности",
        "description": "Память Петра и Февронии."
    },
    {
        "id": "07-09",
        "name": "День веры в единорогов",
        "description": "День фантазии и волшебства."
    },
    {
        "id": "07-10",
        "name": "День воинской славы России",
        "description": "Победа Петра I над шведами под Полтавой."
    },
    {
        "id": "07-11",
        "name": "Всемирный день шоколада",
        "description": "Праздник, придуманный французами."
    },
    {
        "id": "07-12",
        "name": "День фотографа",
        "description": "День святой Вероники."
    },
    {
        "id": "07-13",
        "name": "Международный день головоломки",
        "description": "В день рождения Эрнё Рубика."
    },
    {
        "id": "07-14",
        "name": "День взятия Бастилии",
        "description": "Национальный праздник Франции."
    },
    {
        "id": "07-15",
        "name": "Всемирный день навыков молодежи",
        "description": "Развитие талантов."
    },
    {
        "id": "07-16",
        "name": "День вкусной еды",
        "description": "Повод устроить гастрономический тур."
    },
    {
        "id": "07-17",
        "name": "День основания морской авиации ВМФ России",
        "description": "Профессиональный праздник."
    },
    {
        "id": "07-18",
        "name": "Международный день Нельсона Манделы",
        "description": "День свободы."
    },
    {
        "id": "07-19",
        "name": "День пирожков с малиной",
        "description": "Самый ягодный праздник лета."
    },
    {
        "id": "07-20",
        "name": "Международный день шахмат",
        "description": "Популяризация интеллектуальной игры."
    },
    {
        "id": "07-21",
        "name": "День мороженого",
        "description": "Главный десерт июля."
    },
    {
        "id": "07-22",
        "name": "Всемирный день мозга",
        "description": "Здоровье центральной нервной системы."
    },
    {
        "id": "07-23",
        "name": "Всемирный день китов и дельфинов",
        "description": "Охрана морских млекопитающих."
    },
    {
        "id": "07-24",
        "name": "День флориста",
        "description": "Мастерство создания букетов."
    },
    {
        "id": "07-25",
        "name": "День сотрудника органов следствия РФ",
        "description": "Профессиональный праздник."
    },
    {
        "id": "07-26",
        "name": "День загадывания загадок",
        "description": "Время размять ум."
    },
    {
        "id": "07-27",
        "name": "День рождения гамбургера",
        "description": "В 1900 году продан первый «бургер»."
    },
    {
        "id": "07-28",
        "name": "День Крещения Руси",
        "description": "Память князя Владимира."
    },
    {
        "id": "07-29",
        "name": "Международный день тигра",
        "description": "Сохранение популяции редких кошек."
    },
    {
        "id": "07-30",
        "name": "Международный день дружбы",
        "description": "Принят ООН для укрепления мира."
    },
    {
        "id": "07-31",
        "name": "День системного администратора",
        "description": "Праздник тех, кто чинит наш интернет."
    },
    {
        "id": "08-01",
        "name": "День памяти погибших в Первой мировой войне",
        "description": "Историческая памятная дата."
    },
    {
        "id": "08-02",
        "name": "День ВДВ",
        "description": "День «голубых беретов»."
    },
    {
        "id": "08-03",
        "name": "Всемирный день арбуза",
        "description": "Кульминация сезона бахчевых."
    },
    {
        "id": "08-04",
        "name": "День рождения шампанского",
        "description": "Монах Периньон представил напиток в 1668 г."
    },
    {
        "id": "08-05",
        "name": "Международный день светофора",
        "description": "Появился в США в 1914 году."
    },
    {
        "id": "08-06",
        "name": "Всемирный день «Врачи мира за мир»",
        "description": "Память о Хиросиме."
    },
    {
        "id": "08-07",
        "name": "День собирания звезд",
        "description": "Время самых ярких метеорных потоков."
    },
    {
        "id": "08-08",
        "name": "Всемирный день кошек",
        "description": "Еще один повод погладить кота."
    },
    {
        "id": "08-09",
        "name": "Всемирный день книголюбов",
        "description": "Праздник всех читателей."
    },
    {
        "id": "08-10",
        "name": "День попутного ветра",
        "description": "Праздник путешественников."
    },
    {
        "id": "08-11",
        "name": "День «мусорной еды»",
        "description": "Один день в году, когда можно фастфуд."
    },
    {
        "id": "08-12",
        "name": "Международный день молодежи",
        "description": "Внимание к проблемам молодых."
    },
    {
        "id": "08-13",
        "name": "Международный день левшей",
        "description": "Особенности жизни в мире правшей."
    },
    {
        "id": "08-14",
        "name": "Медовый Спас",
        "description": "Первый из трех летних спасов."
    },
    {
        "id": "08-15",
        "name": "День археолога",
        "description": "Профессиональный праздник исследователей прошлого."
    },
    {
        "id": "08-16",
        "name": "День «Настоящая любовь навсегда»",
        "description": "Романтический праздник."
    },
    {
        "id": "08-17",
        "name": "День проснувшихся улиток",
        "description": "Время для созерцания и неспешности."
    },
    {
        "id": "08-18",
        "name": "День географа в России",
        "description": "Праздник исследователей Земли."
    },
    {
        "id": "08-19",
        "name": "Яблочный Спас",
        "description": "Традиционный день сбора урожая яблок."
    },
    {
        "id": "08-20",
        "name": "Всемирный день лени",
        "description": "Праздник тех, кто умеет отдыхать."
    },
    {
        "id": "08-21",
        "name": "День Сбора Семян",
        "description": "Пора готовиться к следующему сезону."
    },
    {
        "id": "08-22",
        "name": "День Государственного флага РФ",
        "description": "История триколора."
    },
    {
        "id": "08-23",
        "name": "День воинской славы России",
        "description": "Разгром немцев на Курской дуге."
    },
    {
        "id": "08-24",
        "name": "День рождения картофельных чипсов",
        "description": "Созданы в 1853 году."
    },
    {
        "id": "08-25",
        "name": "День «поцелуемся и помиримся»",
        "description": "День прощения обид."
    },
    {
        "id": "08-26",
        "name": "Праздник неприкаянных мыслей",
        "description": "День для философских раздумий."
    },
    {
        "id": "08-27",
        "name": "День российского кино",
        "description": "В честь первого киносеанса в России."
    },
    {
        "id": "08-28",
        "name": "Успение Пресвятой Богородицы",
        "description": "Великий христианский праздник."
    },
    {
        "id": "08-29",
        "name": "Ореховый (Хлебный) Спас",
        "description": "Третий праздник урожая."
    },
    {
        "id": "08-30",
        "name": "День Республики Татарстан",
        "description": "Региональный праздник."
    },
    {
        "id": "08-31",
        "name": "День ветеринарного работника в России",
        "description": "Праздник Айболитов."
    },
    {
        "id": "09-01",
        "name": "День знаний",
        "description": "Начало учебного года в школах и вузах."
    },
    {
        "id": "09-02",
        "name": "День российской гвардии",
        "description": "Праздник элитных воинских частей."
    },
    {
        "id": "09-03",
        "name": "День солидарности в борьбе с терроризмом",
        "description": "Памятная дата в РФ."
    },
    {
        "id": "09-04",
        "name": "День специалиста по ядерному обеспечению",
        "description": "Профессиональный праздник."
    },
    {
        "id": "09-05",
        "name": "Международный день благотворительности",
        "description": "В день памяти матери Терезы."
    },
    {
        "id": "09-06",
        "name": "День полетов над землей",
        "description": "Праздник мечтателей и авиаторов."
    },
    {
        "id": "09-07",
        "name": "Всемирный день уничтожения военной игрушки",
        "description": "Акция за мирное детство."
    },
    {
        "id": "09-08",
        "name": "Международный день грамотности",
        "description": "Проверка своих знаний языка."
    },
    {
        "id": "09-09",
        "name": "Международный день красоты",
        "description": "Праздник эстетики и косметологии."
    },
    {
        "id": "09-10",
        "name": "Всемирный день предотвращения самоубийств",
        "description": "Психологическая поддержка."
    },
    {
        "id": "09-11",
        "name": "Всемирный день трезвости",
        "description": "Популяризация здорового образа жизни."
    },
    {
        "id": "09-12",
        "name": "День осознанности",
        "description": "День медитации и внутреннего спокойствия."
    },
    {
        "id": "09-13",
        "name": "День программиста",
        "description": "Отмечается в 256-й день года."
    },
    {
        "id": "09-14",
        "name": "Праздник славянского Нового года (Новолетие)",
        "description": "Древняя дата."
    },
    {
        "id": "09-15",
        "name": "День рождения экологической организации «Гринпис»",
        "description": "Основан в 1971 году."
    },
    {
        "id": "09-16",
        "name": "Международный день охраны озонового слоя Земли",
        "description": "Экологическая дата."
    },
    {
        "id": "09-17",
        "name": "День разговоров с городом",
        "description": "День прогулок и созерцания архитектуры."
    },
    {
        "id": "09-18",
        "name": "Всемирный день мониторинга воды",
        "description": "Проверка качества ресурсов."
    },
    {
        "id": "09-19",
        "name": "День рождения «Смайлика»",
        "description": "В 1982 году Скотт Фалман предложил символ :-)."
    },
    {
        "id": "09-20",
        "name": "Всемирный день риса",
        "description": "Главный злак планеты."
    },
    {
        "id": "09-21",
        "name": "Международный день мира",
        "description": "День всеобщего прекращения огня."
    },
    {
        "id": "09-22",
        "name": "Всемирный день без автомобиля",
        "description": "Призыв пересесть на велосипеды или идти пешком."
    },
    {
        "id": "09-23",
        "name": "День осеннего равноденствия",
        "description": "Астрономическое начало осени."
    },
    {
        "id": "09-24",
        "name": "Международный день караванщика",
        "description": "Праздник участников транспортных колонн."
    },
    {
        "id": "09-25",
        "name": "Всемирный день фармацевта",
        "description": "Праздник работников аптек."
    },
    {
        "id": "09-26",
        "name": "Европейский день языков",
        "description": "Изучение иностранных наречий."
    },
    {
        "id": "09-27",
        "name": "Всемирный день туризма",
        "description": "Праздник путешественников и гидов."
    },
    {
        "id": "09-28",
        "name": "День генерального директора в России",
        "description": "Праздник топ-менеджеров."
    },
    {
        "id": "09-29",
        "name": "Всемирный день сердца",
        "description": "Профилактика сердечно-сосудистых заболеваний."
    },
    {
        "id": "09-30",
        "name": "День интернета в России",
        "description": "Праздник всех пользователей сети."
    },
    {
        "id": "10-01",
        "name": "Международный день пожилых людей",
        "description": "Уважение к старшему поколению."
    },
    {
        "id": "10-02",
        "name": "Международный день ненасилия",
        "description": "В день рождения Махатмы Ганди."
    },
    {
        "id": "10-03",
        "name": "Всемирный день грибника",
        "description": "Разгар «тихой охоты»."
    },
    {
        "id": "10-04",
        "name": "Всемирный день животных",
        "description": "Защита прав братьев наших меньших."
    },
    {
        "id": "10-05",
        "name": "Всемирный день учителя",
        "description": "Профессиональный праздник педагогов."
    },
    {
        "id": "10-06",
        "name": "Всемирный день охраны мест обитаний",
        "description": "Сохранение экосистем."
    },
    {
        "id": "10-07",
        "name": "Всемирный день улыбки",
        "description": "«Сделай доброе дело. Помоги улыбнуться одному человеку»."
    },
    {
        "id": "10-08",
        "name": "День командира надводного, подводного и воздушного корабля РФ",
        "description": "Профессиональный праздник."
    },
    {
        "id": "10-09",
        "name": "Всемирный день почты",
        "description": "Роль почтовых услуг в мире."
    },
    {
        "id": "10-10",
        "name": "Всемирный день психического здоровья",
        "description": "Важность душевного равновесия."
    },
    {
        "id": "10-11",
        "name": "Международный день девочек",
        "description": "Права и возможности юных леди."
    },
    {
        "id": "10-12",
        "name": "День шоколадных сюрпризов",
        "description": "Время для маленьких радостей."
    },
    {
        "id": "10-13",
        "name": "Всемирный день зрения",
        "description": "Забота о здоровье глаз."
    },
    {
        "id": "10-14",
        "name": "Покров Пресвятой Богородицы",
        "description": "Великий православный праздник."
    },
    {
        "id": "10-15",
        "name": "Всемирный день мытья рук",
        "description": "Профилактика инфекций."
    },
    {
        "id": "10-16",
        "name": "Всемирный день хлеба",
        "description": "Чествование главного продукта на столе."
    },
    {
        "id": "10-17",
        "name": "День электронных таблиц",
        "description": "Профессиональный праздник аналитиков."
    },
    {
        "id": "10-18",
        "name": "День женского счастья",
        "description": "Праздник заботы о прекрасном поле."
    },
    {
        "id": "10-19",
        "name": "Всероссийский день лицеиста",
        "description": "Основание Царскосельского лицея."
    },
    {
        "id": "10-20",
        "name": "Международный день повара",
        "description": "Праздник кулинарных мастеров."
    },
    {
        "id": "10-21",
        "name": "День лабиринта",
        "description": "День загадок и поиска путей."
    },
    {
        "id": "10-22",
        "name": "Праздник Белых Журавлей",
        "description": "День поэзии и памяти павших героев."
    },
    {
        "id": "10-23",
        "name": "День работников рекламы в России",
        "description": "Профессиональный праздник."
    },
    {
        "id": "10-24",
        "name": "День Организации Объединенных Наций",
        "description": "Годовщина вступления в силу Устава ООН."
    },
    {
        "id": "10-25",
        "name": "День таможенника Российской Федерации",
        "description": "Профессиональный праздник."
    },
    {
        "id": "10-26",
        "name": "День приятных неожиданностей",
        "description": "Время удивлять близких."
    },
    {
        "id": "10-27",
        "name": "Всемирный день аудиовизуального наследия",
        "description": "Кино и звукозаписи."
    },
    {
        "id": "10-28",
        "name": "Международный день анимации",
        "description": "В честь первого показа «светящихся пантомим»."
    },
    {
        "id": "10-29",
        "name": "День рождения Комсомола",
        "description": "Историческая дата молодежного движения."
    },
    {
        "id": "10-30",
        "name": "День основания Российского военно-морского флота",
        "description": "Основан в 1696 году."
    },
    {
        "id": "10-31",
        "name": "Международный день экономии",
        "description": "Бережное отношение к ресурсам."
    },
    {
        "id": "11-01",
        "name": "Всемирный день вегана",
        "description": "Идеология растительного питания."
    },
    {
        "id": "11-02",
        "name": "День кормления птиц",
        "description": "Подготовка пернатых к холодам."
    },
    {
        "id": "11-03",
        "name": "День хранения тайны",
        "description": "День молчания и секретов."
    },
    {
        "id": "11-04",
        "name": "День народного единства",
        "description": "Государственный праздник России."
    },
    {
        "id": "11-05",
        "name": "День военного разведчика в России",
        "description": "Профессиональный праздник."
    },
    {
        "id": "11-06",
        "name": "Международный день предотвращения эксплуатации окружающей среды во время войн",
        "description": "Экологическая дата."
    },
    {
        "id": "11-07",
        "name": "День Октябрьской революции 1917 года",
        "description": "Памятная историческая дата."
    },
    {
        "id": "11-08",
        "name": "Международный день КВН",
        "description": "Праздник находчивых и юмористов."
    },
    {
        "id": "11-09",
        "name": "Всемирный день книги рекордов Гиннесса",
        "description": "Праздник достижений."
    },
    {
        "id": "11-10",
        "name": "День сотрудника органов внутренних дел РФ",
        "description": "День полиции."
    },
    {
        "id": "11-11",
        "name": "Всемирный день шопинга (День холостяка)",
        "description": "Время больших скидок."
    },
    {
        "id": "11-12",
        "name": "Синичкин день",
        "description": "Экологический праздник встречи зимующих птиц."
    },
    {
        "id": "11-13",
        "name": "Всемирный день доброты",
        "description": "Девиз дня — «Твори добро»."
    },
    {
        "id": "11-14",
        "name": "Всемирный день борьбы с диабетом",
        "description": "Осведомленность о болезни."
    },
    {
        "id": "11-15",
        "name": "Всероссийский день призывника",
        "description": "День будущих воинов."
    },
    {
        "id": "11-16",
        "name": "Международный день терпимости (толерантности)",
        "description": "Уважение к различиям."
    },
    {
        "id": "11-17",
        "name": "Международный день студентов",
        "description": "Праздник молодежной солидарности."
    },
    {
        "id": "11-18",
        "name": "День рождения Деда Мороза",
        "description": "Считается началом зимы в Великом Устюге."
    },
    {
        "id": "11-19",
        "name": "Международный мужской день",
        "description": "Признание достижений мужчин."
    },
    {
        "id": "11-20",
        "name": "Всемирный день ребенка",
        "description": "Принят ООН для защиты прав детей."
    },
    {
        "id": "11-21",
        "name": "Всемирный день телевидения",
        "description": "Роль ТВ в современном мире."
    },
    {
        "id": "11-22",
        "name": "День сыновей",
        "description": "Праздник мальчиков в семье."
    },
    {
        "id": "11-23",
        "name": "День вставания с той ноги",
        "description": "День позитивного настроя."
    },
    {
        "id": "11-24",
        "name": "День моржа",
        "description": "Экологический праздник защиты ластоногих."
    },
    {
        "id": "11-25",
        "name": "Международный день борьбы за ликвидацию насилия в отношении женщин",
        "description": "Социальная дата."
    },
    {
        "id": "11-26",
        "name": "Всемирный день информации",
        "description": "Эра передачи и обработки данных."
    },
    {
        "id": "11-27",
        "name": "День морской пехоты в России",
        "description": "Праздник «черных беретов»."
    },
    {
        "id": "11-28",
        "name": "День пьяного ежика",
        "description": "Старый венгерский праздник урожая."
    },
    {
        "id": "11-29",
        "name": "День матери в России",
        "description": "Самый теплый праздник (последнее воскресенье ноября)."
    },
    {
        "id": "11-30",
        "name": "Всемирный день домашних животных",
        "description": "Ответственность за питомцев."
    },
    {
        "id": "12-01",
        "name": "Всемирный день борьбы со СПИДом",
        "description": "Солидарность в борьбе с эпидемией."
    },
    {
        "id": "12-02",
        "name": "День банковского работника России",
        "description": "Профессиональный праздник."
    },
    {
        "id": "12-03",
        "name": "Международный день инвалидов",
        "description": "Поддержка людей с ограниченными возможностями."
    },
    {
        "id": "12-04",
        "name": "День заказов подарков Деду Морозу",
        "description": "Время писать письма на север."
    },
    {
        "id": "12-05",
        "name": "Всемирный день волонтера",
        "description": "Чествование добровольцев."
    },
    {
        "id": "12-06",
        "name": "День рождения микроволновой печи",
        "description": "Запатентована в 1945 году."
    },
    {
        "id": "12-07",
        "name": "Международный день гражданской авиации",
        "description": "Безопасность полетов."
    },
    {
        "id": "12-08",
        "name": "Международный день художника",
        "description": "Праздник творческих натур."
    },
    {
        "id": "12-09",
        "name": "День Героев Отечества в России",
        "description": "Память о героях."
    },
    {
        "id": "12-10",
        "name": "День прав человека",
        "description": "Принятие Всеобщей декларации."
    },
    {
        "id": "12-11",
        "name": "Международный день гор",
        "description": "Охрана горных районов и культуры."
    },
    {
        "id": "12-12",
        "name": "День Конституции Российской Федерации",
        "description": "Главный закон страны."
    },
    {
        "id": "12-13",
        "name": "День горячего шоколада",
        "description": "Самый уютный напиток зимы."
    },
    {
        "id": "12-14",
        "name": "Наумов день",
        "description": "В старину в этот день начинали учить детей грамоте."
    },
    {
        "id": "12-15",
        "name": "Международный день чая",
        "description": "Популяризация чайной культуры."
    },
    {
        "id": "12-16",
        "name": "День мировой немоты и тишины",
        "description": "Время побыть наедине с собой."
    },
    {
        "id": "12-17",
        "name": "День Ракетных войск стратегического назначения (РВСН) РФ",
        "description": "Профессиональный праздник."
    },
    {
        "id": "12-18",
        "name": "Международный день мигранта",
        "description": "Поддержка прав мигрантов."
    },
    {
        "id": "12-19",
        "name": "День святого Николая Чудотворца",
        "description": "Традиция дарить подарки детям."
    },
    {
        "id": "12-20",
        "name": "День работника органов безопасности РФ",
        "description": "День ФСБ."
    },
    {
        "id": "12-21",
        "name": "День зимнего солнцестояния",
        "description": "Самая длинная ночь в году."
    },
    {
        "id": "12-22",
        "name": "День энергетика",
        "description": "Профессиональный праздник тех, кто дает нам свет и тепло."
    },
    {
        "id": "12-23",
        "name": "Всемирный день сноубординга",
        "description": "Праздник зимнего спорта."
    },
    {
        "id": "12-24",
        "name": "Католический Сочельник",
        "description": "Вечер перед западным Рождеством."
    },
    {
        "id": "12-25",
        "name": "Рождество Христово (по григорианскому календарю)",
        "description": "Католическое и протестантское Рождество."
    },
    {
        "id": "12-26",
        "name": "День подарков (Boxing Day)",
        "description": "Традиция обмениваться коробками с сюрпризами."
    },
    {
        "id": "12-27",
        "name": "День спасателя в России",
        "description": "Праздник сотрудников МЧС."
    },
    {
        "id": "12-28",
        "name": "Международный день кино",
        "description": "В честь первого сеанса братьев Люмьер."
    },
    {
        "id": "12-29",
        "name": "День «Еще столько всего нужно сделать!»",
        "description": "Финишная прямая перед Новым годом."
    },
    {
        "id": "12-30",
        "name": "День образования СССР",
        "description": "Историческая дата (1922 год)."
    },
    {
        "id": "12-31",
        "name": "Канун Нового года",
        "description": "Подготовка к главной ночи в году."
    }
]
const buttons = document.querySelectorAll('.button');
const circle = document.querySelector('.circle');

buttons.forEach(btn => {
    btn.addEventListener('click', () => {
        const Style = window.getComputedStyle(btn);
        const color = Style.backgroundColor;  
        
        // circle.classList.remove('is-large');
        // circle.style.transition = 'none';

        // void circle.offsetWidth; 

        // circle.style.backgroundImage = `radial-gradient(circle, ${color}, transparent)`;
        // circle.style.transition = 'transform 1s ease';

        // circle.classList.add('is-large');
        setTimeout(() => {
            document.body.style.backgroundColor = color;
            // circle.classList.remove('is-large');
        }, 0);
    });
  });

const date = document.querySelector('.date');

date.addEventListener('change', function(e){
    let date_text = e.target.value
    let date_split = date_text.split('-')
    let month = date_split[1]
    let day = date_split[2]
    let monthday = month+'-'+day
    for (let i = 0; i<spisok.length; i++){
        let element = spisok[i]
        if (element.id == monthday){
            document.getElementById('text').innerHTML = element
            break
        }
           
    }
    
    

})